In [2]:
import pandas as pd 

df=pd.read_csv("outlier.csv",sep=';')
df

      name  height
0      can      88
1      ali     132
2    tugce     134
3     ayse     137
4    nihan     139
5    sahin     142
6     kaan     142
7     emre     144
8    bartu     147
9   ismail     148
10  gokalp     149
11   osman     149
12   filiz     150
13    veli     207
14   ilker     234

In [3]:
df.describe()

           height
count   15.000000
mean   149.466667
std     32.943386
min     88.000000
25%    138.000000
50%    144.000000
75%    149.000000
max    234.000000

In [4]:
Q1=df.height.quantile(0.25)
Q1

138.0

In [6]:
Q3=df.height.quantile(0.75)
Q3

149.0

In [7]:
IQR_value=Q3-Q1
IQR_value

11.0

In [8]:
lower_limit=Q1-1.5*IQR_value
lower_limit

121.5

In [9]:
upper_limit=Q3+1.5*IQR_value
upper_limit

165.5

In [10]:
df[(df.height<lower_limit)|(df.height>upper_limit)]

     name  height
0     can      88
13   veli     207
14  ilker     234

In [11]:
df_filtered=df[(df.height>lower_limit)&(df.height<upper_limit)]
df_filtered

      name  height
1      ali     132
2    tugce     134
3     ayse     137
4    nihan     139
5    sahin     142
6     kaan     142
7     emre     144
8    bartu     147
9   ismail     148
10  gokalp     149
11   osman     149
12   filiz     150